{
  "Pages": [
      {
          "title": "Page 1",
          "bodyText": "<h1>Getting Started</h1><p>Welcome to the <strong>Documentation Viewer</strong>. This guide will help you understand how to use the app efficiently. Follow the steps below to get started:</p><h2>Step 1: Navigate</h2><p>Use the menu on the left to navigate between pages. Each page contains specific information relevant to its title.</p><h2>Step 2: Edit Pages</h2><p>Click the <strong>Edit</strong> button to modify content on a page. Once done, click <strong>Complete</strong> to save your changes.</p><h2>Step 3: Export Documentation</h2><p>You can export the entire documentation as a JSON file by clicking the <strong>Export JSON</strong> button in the sidebar.</p><p>This app is designed for small-scale documentation management, making it ideal for internal projects or personal use cases. Explore other pages to learn more!</p>"


      },
      {
          "title": "Page 2",
          "bodyText": "<h1>Features Overview</h1><p>The Documentation Viewer is packed with the following features to enhance your experience:</p><ul><li><strong>Intuitive Navigation:</strong> Quickly switch between different documentation pages using the sidebar.</li><li><strong>Markdown Editing:</strong> Modify content with live Markdown preview for formatting simplicity.</li><li><strong>Export Options:</strong> Save your documentation as a JSON file for easy sharing or backup.</li></ul><p>These features are tailored to provide a lightweight and efficient solution for managing documentation. Stay tuned for more advanced features in future updates!</p>"
        },
      {
          "title": "Page 3",
          "bodyText": "## Motu tegi vulnus ad quod irascentemque esse\r\n\r\nLorem markdownum tibi, patri non tenuere. Loqui manu inpatiens clarus, [aras\r\nversa](http:\/\/www.inhospitapatriae.com\/) ablata *mixtaeque senectam* sancta\r\n[palles](http:\/\/cum-quae.io\/et) partim non et auras data cum fera, queritur.\r\nOstendit terrae medendi, orbus parvo, onerosa, inquit, verba subit. Ignescere\r\npervia Icare, post illud mente tenuata dicere.\r\n\r\n1. Uno Iovem\r\n2. Iuves si fletus mutatur Astypaleia petit\r\n3. Vapore urit suscipimus detur\r\n4. Calculus indigenis qui copia Venerem\r\n\r\n## Gorgoneas alta donisque operum\r\n\r\nQualiacumque cuspide erat membra tantum inpositum lactisque sternebat ultima\r\nversus, sororis. Quod mille pharetrae auras signa montes, quatiens murraeque\r\npennis. Non penetrat Cupido; redimat est esse ille putet Nesso amicior attonitus\r\n[Rhesi](http:\/\/voluere-est.org\/nec) et vulnus crimina Palladaque parte meritum\r\ninvita. Achaidos Cycnus que data infringere cumque atria rutilis renarrant,\r\n[videri](http:\/\/www.rapuit.com\/terga.php)? Temptat matrona quodcumque movere\r\nHyadasque ille, cum vertice aquis sacrilega obicit et pariterque spectat deo.\r\n\r\nTollere exiguas membris manus tum Troia erratica viri, sui? Micant nec\r\nincunabula antro **Herculeos frendens** virgo pectora illo, at multas\r\n[et](http:\/\/vetustas.net\/ab-obruit.html) gutture troia modo. Pandion Procris;\r\namplectitur unus sitim aquis *et ignaram* adsere Marte: recessit: hospes. Sine\r\nquod, roga quam, poscit fulva facitis, magno, hos cui supponas illa tamen\r\n**recentes protinus**. Constituit utero,\r\n[relinquit](http:\/\/secessit-utque.net\/), qui artus dissuaserat Danaen,\r\ndefendere.\r\n\r\n## Illic maturuit aequora fama ad effreno pudorem\r\n\r\nAit Rhodanumque, incessere **rexque**. Foventque cupiens: videri et dissidet\r\ncaper tollere quibus, protinus, sola.\r\n\r\n> Iam contegat et Sminthea omnia superum Phoebes, **precando non contra**\r\n> graminis iuventam taurus! Sentiet frigore rubori omni, Arachnes dixerat exit\r\n> [petenti crescitque vigil](http:\/\/teneo.org\/caruissesociare) et. Fontis chaos,\r\n> siquis per necem transitus monebat: cremabis.\r\n\r\n## Non medium vel\r\n\r\n[Audentes inmenso pariterque](http:\/\/unumque.net\/) solebat et is, et inferre,\r\nerat tibi, nec hac sub memorabile fugit ambit?\r\n[Celebratior](http:\/\/ite.io\/abit-amplius) fibras Troia, et pedem facinus, ad\r\nvetat, potest, templa. Sine pectora lacrimans naris tenebras ita valens desit,\r\nuna nec tremens!\r\n\r\n1. Mihi mater Melaneus et ante hanc nefas\r\n2. Commota illo postquam\r\n3. Suppositosque aestuque hunc sulco ora facta esset\r\n\r\nDestruitis Andron humano, huc ora virgineus illis nescis maris obusta stetit\r\nautumnalia, me chordas. Victor **fluctibus** flumina lacrimas summos quod, visi\r\nquoque circum simul, molliri. Hic diu mihi fugit quantumque refugerit colorem\r\nnec aut carentia capite."
      },
      {
          "title": "Another page",
          "bodyText": "<h1>Advanced Markdown Tips</h1><p>Here are some Markdown tricks you can use to enhance your documentation:</p><ul><li><strong>Headers:</strong> Use <code>#</code> for H1, <code>##</code> for H2, and so on.</li><li><strong>Lists:</strong> Use <code>-</code> for unordered lists and numbers for ordered lists.</li><li><strong>Links:</strong> Use <code>[Link Text](URL)</code> to add hyperlinks.</li><li><strong>Images:</strong> Use <code>![Alt Text](Image URL)</code> to add images.</li></ul><p>Experiment with these tips to make your documentation more visually appealing and easier to read!</p>"
        },
      {
          "title": "Another important page",
          "bodyText": "## Plus pietas in pennisque saeva scitarier in\r\n\r\nLorem markdownum contentus oppressumque silva *alii* per honori sed fetibus\r\n**deos**. Loquaci ut movebo dextera *est fugacis* aequor.\r\n\r\nNec odiis in primumque Iovisque ponere me tantorum denique qui silvae similis\r\nLichan nec aegro; erit dolorem. Vocamus aquae, est [videri\r\nad](http:\/\/www.ibat-dedignata.org\/) dependebat medendi fuit frondibus suo flebat\r\nvincta pariterque Arabas puer. Niger et locorum lotos genitore.\r\n\r\n## Moenia ab ipsam\r\n\r\n[Fuit](http:\/\/nec.com\/umeros.php) egit fratres mandata, tune illa uteri ambo\r\nest, est Hectoris senex est. Quid turis Themis retia plangor currus certis,\r\ncorpore et *sua melius* mihi decorum *pennis*, totidemque.\r\n\r\n> In tandem, struxisse et noctis sanguine auris tremore: non, ubi suum. Quae\r\n> fratrem *dolebat*. Oculos prementem Morphea perque me quod accendit fecerat,\r\n> est loqui in fert, dici teneo: nec. Erubuit ponto non adopertaque, trahor:\r\n> finiat Alcyone hippomene longum prole; vera pietas messes minores!\r\n\r\n## Pectus et acta cum non captaeque et\r\n\r\nAtras est quae sedes rogantum imbres, et in inquit tantummodo maximus. Functaque\r\nad orbem armisque quisquis *tamen*, recumbit sustinet *perfringit in sparsit*.\r\nMeis prohibes, frontem illum enim nostra curva, mea alae ego? Cycnorum deorum\r\nadmissa Ulixes.\r\n\r\n## Matrisque nihil vota sceleri numerumque hoc silva\r\n\r\nPedibus reversurum: caligine concedant arcum precibusque caerulus sensit, et.\r\nDefenderet inrita, altera bracchia parvoque ipsum rogavi. Notatas nymphen\r\nspargit. Et gaudeat illud *aquila* commenta convellere felix corpore quidem\r\nveretur, *ictus tulit* mundi solet *nantemque*.\r\n\r\n## Montibus Iovis\r\n\r\nTexta Adonis se sexta qua unguibus sint spoliat crescitque cognoscet sine\r\nOrchomenon viro. Radicibus fuerat dextra, *et aut artes* sedulitas quique\r\noccurrunt habent cervice; et sorsque feremus dixit crura ausa rogant.\r\n\r\n> Inhibe patriisque auras requievit aquas perit factos orbem, motura et ut tuos\r\n> feruntur. Nunc non incepta in undique **nobis amorem** relinquis, in aquae\r\n> caelum qua colus. Exiguamque calamo pennis niteant, sed Pithecusas utque.\r\n\r\nFluunt tamen mihi Autolycus pavent, considerat in amorem in quid, multis in\r\nfigit sucis plenissima ego positoque. Me arma **multos aevum** contraria quem;\r\noneris urbes simul est in errante guttura dixit serpere spectant domosque sonat."
      },
      {
          "title": "Second to last page",
          "bodyText": "<h1>Future Roadmap</h1><p>The Documentation Viewer will evolve with time. Here's what's planned for future releases:</p><ul><li><strong>Search Functionality:</strong> Quickly search through documentation pages with a built-in search bar.</li><li><strong>Theme Customization:</strong> Choose between light and dark themes to suit your preference.</li><li><strong>Database Integration:</strong> Dynamically load content from a database for larger-scale projects.</li><li><strong>User Authentication:</strong> Allow multiple users to access and modify the documentation with secure authentication.</li></ul><p>If you have any suggestions for features, feel free to reach out to us!</p>"
        },
      {
          "title": "Last page",
          "bodyText": "<h1>Best Practices for Writing Documentation</h1><p>Good documentation is key to the success of any project. Here are some tips to keep in mind:</p><ol><li><strong>Be Clear and Concise:</strong> Use simple language and short sentences to explain your points.</li><li><strong>Organize Content:</strong> Use headers, lists, and sections to break down information into manageable chunks.</li><li><strong>Include Examples:</strong> Show examples wherever possible to help users understand complex concepts.</li><li><strong>Update Regularly:</strong> Keep your documentation up-to-date as your project evolves.</li></ol><p>Remember, good documentation makes a project more accessible and easier to maintain!</p>"
        }
  ]
}